# Задание-1:
# Матрицы в питоне реализуются в виде вложенных списков:
# Пример. Дано:
matrix = [[1, 0, 8],
          [3, 4, 1],
          [0, 4, 2]]
          
# Выполнить поворот (транспонирование) матрицы
# Пример. Результат:
# matrix_rotate = [[1, 3, 0],
#                  [0, 4, 4],
#                  [8, 1, 2]]

# Суть сложности hard: Решите задачу в одну строку

matrix_rotate = [list(x) for x in zip(*matrix)]
print(matrix_rotate)
print()


# Задание-2:
# Найдите наибольшее произведение пяти последовательных цифр в 1000-значном числе.
# Выведите произведение и индекс смещения первого числа последовательных 5-ти цифр.
# Пример 1000-значного числа:
# number = """
# 73167176531330624919225119674426574742355349194934
# 96983520312774506326239578318016984801869478851843
# 85861560789112949495459501737958331952853208805511
# 12540698747158523863050715693290963295227443043557
# 66896648950445244523161731856403098711121722383113
# 62229893423380308135336276614282806444486645238749
# 30358907296290491560440772390713810515859307960866
# 70172427121883998797908792274921901699720888093776
# 65727333001053367881220235421809751254540594752243
# 52584907711670556013604839586446706324415722155397
# 53697817977846174064955149290862569321978468622482
# 83972241375657056057490261407972968652414535100474
# 82166370484403199890008895243450658541227588666881
# 16427171479924442928230863465674813919123162824586
# 17866458359124566529476545682848912883142607690042
# 24219022671055626321111109370544217506941658960408
# 07198403850962455444362981230987879927244284909188
# 84580156166097919133875499200524063689912560717606
# 05886116467109405077541002256983155200055935729725
# 71636269561882670428252483600823257530420752963450"""
#
# number = number.replace("\n", "")

def problem_2(n):
    """
    Поиск наибольшего произведения пяти последовательных цифр в n-значном числе
    :param n: целое число - количество цифр в числе
    :return:
    """

    def mul(lst):
        """
        Вычисление произведения последовательности чисел
        :param lst: список чисел
        :return: произведение чисел
        """
        result = 1
        for x in lst:
            result *= x
        return result

    import random
    # Генерация строки длиной n, состоящей из случайных цифр
    number = "".join(str(random.randint(0, 9)) for _ in range(n))

    lst_seq = [number[i:i + 5] for i in range(len(number) - 4)]  # Список из всех возможных последовательных 5-ти цифр
    dic_sec = {seq: mul(list(map(int, list(seq)))) for seq in lst_seq}  # Словарь из пятёрок цифр и их произведений
    max_production = max(v for v in dic_sec.values())  # Максимальное произведение цифр последовательностей
    max_seq = list(dic_sec.keys())[list(dic_sec.values()).index(max_production)]  # Последовательность с максимальным прозведением цифр
    ind = number.index(max_seq)     # Смещение первого числа последовательных 5-ти цифр
    print(f"Произведение: {max_production}")
    print(f"Индекс смещения: {ind}")


problem_2(1000)
print()


# Задание-3 (Ферзи):
# Известно, что на доске 8×8 можно расставить 8 ферзей так, чтобы они не били
# друг друга. Вам дана расстановка 8 ферзей на доске.
# Определите, есть ли среди них пара бьющих друг друга.
# Программа получает на вход восемь пар чисел,
# каждое число от 1 до 8 — координаты 8 ферзей.
# Если ферзи не бьют друг друга, выведите слово NO, иначе выведите YES.


def eigth_gueens(queens):
    """
    Ферзи
    :param queens: список из восеми пар чисел
    :return: Если ферзи не бьют друг друга, выведится слово NO, иначе YES.
    """
    import itertools
    result = False
    for index, queen in enumerate(itertools.combinations(queens, 2)):
        horizontal = queen[0][0] == queen[1][0]
        vertical = queen[0][1] == queen[1][1]
        diagonal = abs(queen[0][0] - queen[1][0]) == abs(queen[0][1] - queen[1][1])
        if horizontal or vertical or diagonal:
            result = True
            break
    print("YES") if result else print("NO")


queens_NO = [[1, 4], [2, 7], [3, 3], [4, 8], [5, 2], [6, 5], [7, 1], [8, 6]]
queens_YES_horisontal = [[1, 4], [2, 7], [3, 3], [4, 8], [5, 2], [6, 5], [7, 1], [1, 6]]
queens_YES_vertical = [[1, 4], [2, 7], [3, 3], [4, 8], [5, 2], [6, 5], [7, 1], [8, 4]]
queens_YES_diagonal = [[1, 4], [2, 7], [3, 3], [4, 8], [5, 8], [6, 5], [7, 1], [8, 6]]

eigth_gueens(queens_NO)
eigth_gueens(queens_YES_horisontal)
eigth_gueens(queens_YES_vertical)
eigth_gueens(queens_YES_diagonal)
